{
  "name": "AWS CodeCommit",
  "description": "AWS CodeCommit This is the *AWS CodeCommit API Reference*. This reference provides descriptions of the operations and data types for AWS CodeCommit API along with usage examples.\n\nYou can use the AWS CodeCommit API to work with the following objects:\n\nRepositories, by calling the following:\n\n-   `BatchGetRepositories`, which returns information about one or more repositories associated with your AWS account.\n\n\n-   `CreateRepository`, which creates an AWS CodeCommit repository.\n\n\n-   `DeleteRepository`, which deletes an AWS CodeCommit repository.\n\n\n-   `GetRepository`, which returns information about a specified repository.\n\n\n-   `ListRepositories`, which lists all AWS CodeCommit repositories associated with your AWS account.\n\n\n-   `UpdateRepositoryDescription`, which sets or updates the description of the repository.\n\n\n-   `UpdateRepositoryName`, which changes the name of the repository. If you change the name of a repository, no other users of that repository can access it until you send them the new HTTPS or SSH URL to use.\n\nBranches, by calling the following:\n\n-   `CreateBranch`, which creates a branch in a specified repository.\n\n\n-   `DeleteBranch`, which deletes the specified branch in a repository unless it is the default branch.\n\n\n-   `GetBranch`, which returns information about a specified branch.\n\n\n-   `ListBranches`, which lists all branches for a specified repository.\n\n\n-   `UpdateDefaultBranch`, which changes the default branch for a repository.\n\nFiles, by calling the following:\n\n-   `DeleteFile`, which deletes the content of a specified file from a specified branch.\n\n\n-   `GetBlob`, which returns the base-64 encoded content of an individual Git blob object in a repository.\n\n\n-   `GetFile`, which returns the base-64 encoded content of a specified file.\n\n\n-   `GetFolder`, which returns the contents of a specified folder or directory.\n\n\n-   `PutFile`, which adds or modifies a single file in a specified repository and branch.\n\nCommits, by calling the following:\n\n-   `BatchGetCommits`, which returns information about one or more commits in a repository.\n\n\n-   `CreateCommit`, which creates a commit for changes to a repository.\n\n\n-   `GetCommit`, which returns information about a commit, including commit messages and author and committer information.\n\n\n-   `GetDifferences`, which returns information about the differences in a valid commit specifier (such as a branch, tag, HEAD, commit ID, or other fully qualified reference).\n\nMerges, by calling the following:\n\n-   `BatchDescribeMergeConflicts`, which returns information about conflicts in a merge between commits in a repository.\n\n\n-   `CreateUnreferencedMergeCommit`, which creates an unreferenced commit between two branches or commits for the purpose of comparing them and identifying any potential conflicts.\n\n\n-   `DescribeMergeConflicts`, which returns information about merge conflicts between the base, source, and destination versions of a file in a potential merge.\n\n\n-   `GetMergeCommit`, which returns information about the merge between a source and destination commit.\n\n\n-   `GetMergeConflicts`, which returns information about merge conflicts between the source and destination branch in a pull request.\n\n\n-   `GetMergeOptions`, which returns information about the available merge options between two branches or commit specifiers.\n\n\n-   `MergeBranchesByFastForward`, which merges two branches using the fast-forward merge option.\n\n\n-   `MergeBranchesBySquash`, which merges two branches using the squash merge option.\n\n\n-   `MergeBranchesByThreeWay`, which merges two branches using the three-way merge option.\n\nPull requests, by calling the following:\n\n-   `CreatePullRequest`, which creates a pull request in a specified repository.\n\n\n-   `CreatePullRequestApprovalRule`, which creates an approval rule for a specified pull request.\n\n\n-   `DeletePullRequestApprovalRule`, which deletes an approval rule for a specified pull request.\n\n\n-   `DescribePullRequestEvents`, which returns information about one or more pull request events.\n\n\n-   `EvaluatePullRequestApprovalRules`, which evaluates whether a pull request has met all the conditions specified in its associated approval rules.\n\n\n-   `GetCommentsForPullRequest`, which returns information about comments on a specified pull request.\n\n\n-   `GetPullRequest`, which returns information about a specified pull request.\n\n\n-   `GetPullRequestApprovalStates`, which returns information about the approval states for a specified pull request.\n\n\n-   `GetPullRequestOverrideState`, which returns information about whether approval rules have been set aside (overriden) for a pull request, and if so, the Amazon Resource Name (ARN) of the user or identity that overrode the rules and their requirements for the pull request.\n\n\n-   `ListPullRequests`, which lists all pull requests for a repository.\n\n\n-   `MergePullRequestByFastForward`, which merges the source destination branch of a pull request into the specified destination branch for that pull request using the fast-forward merge option.\n\n\n-   `MergePullRequestBySquash`, which merges the source destination branch of a pull request into the specified destination branch for that pull request using the squash merge option.\n\n\n-   `MergePullRequestByThreeWay`. which merges the source destination branch of a pull request into the specified destination branch for that pull request using the three-way merge option.\n\n\n-   `OverridePullRequestApprovalRules`, which sets aside all approval rule requirements for a pull request.\n\n\n-   `PostCommentForPullRequest`, which posts a comment to a pull request at the specified line, file, or request.\n\n\n-   `UpdatePullRequestApprovalRuleContent`, which updates the structure of an approval rule for a pull request.\n\n\n-   `UpdatePullRequestApprovalState`, which updates the state of an approval on a pull request.\n\n\n-   `UpdatePullRequestDescription`, which updates the description of a pull request.\n\n\n-   `UpdatePullRequestStatus`, which updates the status of a pull request.\n\n\n-   `UpdatePullRequestTitle`, which updates the title of a pull request.\n\nApproval rule templates, by calling the following:\n\n-   `AssociateApprovalRuleTemplateWithRepository`, which associates a template with a specified repository. After the template is associated with a repository, AWS CodeCommit creates approval rules that match the template conditions on every pull request created in the specified repository.\n\n\n-   `BatchAssociateApprovalRuleTemplateWithRepositories`, which associates a template with one or more specified repositories. After the template is associated with a repository, AWS CodeCommit creates approval rules that match the template conditions on every pull request created in the specified repositories.\n\n\n-   `BatchDisassociateApprovalRuleTemplateFromRepositories`, which removes the association between a template and specified repositories so that approval rules based on the template are not automatically created when pull requests are created in those repositories.\n\n\n-   `CreateApprovalRuleTemplate`, which creates a template for approval rules that can then be associated with one or more repositories in your AWS account.\n\n\n-   `DeleteApprovalRuleTemplate`, which deletes the specified template. It does not remove approval rules on pull requests already created with the template.\n\n\n-   `DisassociateApprovalRuleTemplateFromRepository`, which removes the association between a template and a repository so that approval rules based on the template are not automatically created when pull requests are created in the specified repository.\n\n\n-   `GetApprovalRuleTemplate`, which returns information about an approval rule template.\n\n\n-   `ListApprovalRuleTemplates`, which lists all approval rule templates in the AWS Region in your AWS account.\n\n\n-   `ListAssociatedApprovalRuleTemplatesForRepository`, which lists all approval rule templates that are associated with a specified repository.\n\n\n-   `ListRepositoriesForApprovalRuleTemplate`, which lists all repositories associated with the specified approval rule template.\n\n\n-   `UpdateApprovalRuleTemplateDescription`, which updates the description of an approval rule template.\n\n\n-   `UpdateApprovalRuleTemplateName`, which updates the name of an approval rule template.\n\n\n-   `UpdateApprovalRuleTemplateContent`, which updates the content of an approval rule template.\n\nComments in a repository, by calling the following:\n\n-   `DeleteCommentContent`, which deletes the content of a comment on a commit in a repository.\n\n\n-   `GetComment`, which returns information about a comment on a commit.\n\n\n-   `GetCommentReactions`, which returns information about emoji reactions to comments.\n\n\n-   `GetCommentsForComparedCommit`, which returns information about comments on the comparison between two commit specifiers in a repository.\n\n\n-   `PostCommentForComparedCommit`, which creates a comment on the comparison between two commit specifiers in a repository.\n\n\n-   `PostCommentReply`, which creates a reply to a comment.\n\n\n-   `PutCommentReaction`, which creates or updates an emoji reaction to a comment.\n\n\n-   `UpdateComment`, which updates the content of a comment on a commit in a repository.\n\nTags used to tag resources in AWS CodeCommit (not Git tags), by calling the following:\n\n-   `ListTagsForResource`, which gets information about AWS tags for a specified Amazon Resource Name (ARN) in AWS CodeCommit.\n\n\n-   `TagResource`, which adds or updates tags for a resource in AWS CodeCommit.\n\n\n-   `UntagResource`, which removes tags for a resource in AWS CodeCommit.\n\nTriggers, by calling the following:\n\n-   `GetRepositoryTriggers`, which returns information about triggers configured for a repository.\n\n\n-   `PutRepositoryTriggers`, which replaces all triggers for a repository and can be used to create or delete triggers.\n\n\n-   `TestRepositoryTriggers`, which tests the functionality of a repository trigger by sending data to the trigger target.\n\nFor information about how to use AWS CodeCommit, see the [AWS CodeCommit User Guide](https://docs.aws.amazon.com/codecommit/latest/userguide/welcome.html).",
  "categories": [
    "cloud"
  ],
  "logo": "logo.png",
  "openApiJsonUrl": "https://api.apis.guru/v2/specs/amazonaws.com/codecommit/2015-04-13/openapi.json",
  "openApiYamlUrl": "https://api.apis.guru/v2/specs/amazonaws.com/codecommit/2015-04-13/openapi.yaml",
  "openApiVersion": "3.0.0",
  "externalDocsUrl": "https://docs.aws.amazon.com/codecommit/",
  "source": "apis.guru"
}