{
  "name": "Paylocity API",
  "description": "For general questions and support of the API, contact: webservices@paylocity.com\n# Overview\n\nPaylocity Web Services API is an externally facing RESTful Internet protocol. The Paylocity API uses HTTP verbs and a RESTful endpoint structure. OAuth 2.0 is used as the API Authorization framework. Request and response payloads are formatted as JSON.\nPaylocity supports v1 and v2 versions of its API endpoints. v1, while supported, won't be enhanced with additional functionality. For direct link to v1 documentation, please click [here](https://docs.paylocity.com/weblink/guides/Paylocity_Web_Services_API/v1/Paylocity_Web_Services_API.htm). For additional resources regarding v1/v2 differences and conversion path, please contact webservices@paylocity.com.\n\n##### Setup\n\nPaylocity will provide the secure client credentials and set up the scope (type of requests and allowed company numbers). You will receive the unique client id, secret, and Paylocity public key for the data encryption. The secret will expire in 365 days.\n* Paylocity will send you an e-mail 10 days prior to the expiration date for the current secret. If not renewed, the second e-mail notification will be sent 5 days prior to secret's expiration. Each email will contain the code necessary to renew the client secret.\n* You can obtain the new secret by calling API endpoint using your current not yet expired credentials and the code that was sent with the notification email. For details on API endpoint, please see Client Credentials section.\n* Both the current secret value and the new secret value will be recognized during the transition period. After the current secret expires, you must use the new secret.\n* If you were unable to renew the secret via API endpoint, you can still contact Service and they will email you new secret via secure email.\n\nWhen validating the request, Paylocity API will honor the defaults and required fields set up for the company default New Hire Template as defined in Web Pay.\n\n# Authorization\n\nPaylocity Web Services API uses OAuth2.0 Authentication with JSON Message Format.\n\nAll requests of the Paylocity Web Services API require a bearer token which can be obtained by authenticating the client with the Paylocity Web Services API via OAuth 2.0.\n\nThe client must request a bearer token from the authorization endpoint:\n\nauth-server for production: https://api.paylocity.com/IdentityServer/connect/token\n\nauth-server for testing: https://apisandbox.paylocity.com/IdentityServer/connect/token\n\nPaylocity reserves the right to impose rate limits on the number of calls made to our APIs. Changes to API features/functionality may be made at anytime with or without prior notice.\n\n##### Authorization Header\n\nThe request is expected to be in the form of a basic authentication request, with the \"Authorization\" header containing the client-id and client-secret. This means the standard base-64 encoded user:password, prefixed with \"Basic\" as the value for the Authorization header, where user is the client-id and password is the client-secret.\n\n##### Content-Type Header\n\nThe \"Content-Type\" header is required to be \"application/x-www-form-urlencoded\".\n\n##### Additional Values\n\nThe request must post the following form encoded values within the request body:\n\ngrant_type = client_credentials\nscope = WebLinkAPI\n\n##### Responses\n\nSuccess will return HTTP 200 OK with JSON content:\n\n{\n\"access_token\": \"xxx\",\n\"expires_in\": 3600,\n\"token_type\": \"Bearer\"\n}\n\n# Encryption\n\nPaylocity uses a combination of RSA and AES cryptography. As part of the setup, each client is issued a public RSA key.\n\nPaylocity recommends the encryption of the incoming requests as additional protection of the sensitive data. Clients can opt-out of the encryption during the initial setup process. Opt-out will allow Paylocity to process unencrypted requests.\n\nThe Paylocity Public Key has the following properties:\n\n* 2048 bit key size\n\n* PKCS1 key format\n\n* PEM encoding\n\n##### Properties\n\n* key (base 64 encoded): The AES symmetric key encrypted with the Paylocity Public Key. It is the key used to encrypt the content. Paylocity will decrypt the AES key using RSA decryption and use it to decrypt the content.\n\n* iv (base 64 encoded): The AES IV (Initialization Vector) used when encrypting the content.\n\n* content (base 64 encoded): The AES encrypted request. The key and iv provided in the secureContent request are used by Paylocity for decryption of the content.\n\nWe suggest using the following for the AES:\n\n* CBC cipher mode\n\n* PKCS7 padding\n\n* 128 bit block size\n\n* 256 bit key size\n\n##### Encryption Flow\n\n* Generate the unencrypted JSON payload to POST/PUT\n* Encrypt this JSON payload using your _own key and IV_ (NOT with the Paylocity public key)\n* RSA encrypt the _key_ you used in step 2 with the Paylocity Public Key, then, base64 encode the result\n* Base64 encode the IV used to encrypt the JSON payload in step 2\n* Put together a \"securecontent\" JSON object:\n\n{\n'secureContent' : {\n'key' : -- RSA-encrypted & base64 encoded key from step 3,\n'iv' : -- base64 encoded iv from step 4\n'content' -- content encrypted with your own key from step 2, base64 encoded\n}\n}\n\n##### Sample Example\n\n{\n\"secureContent\": {\n\"key\": \"eS3aw6H/qzHMJ00gSi6gQ3xa08DPMazk8BFY96Pd99ODA==\",\n\"iv\": \"NLyXMGq9svw0XO5aI9BzWw==\",\n\"content\": \"gAEOiQltO1w+LzGUoIK8FiYbU42hug94EasSl7N+Q1w=\"\n}\n}\n\n##### Sample C# Code\n\nusing Newtonsoft.Json;\nusing System;\nusing System.IO;\nusing System.Security.Cryptography;\nusing System.Text;\n\npublic class SecuredContent\n{\n[JsonProperty(\"key\")]\npublic string Key { get; set; }\n\n[JsonProperty(\"iv\")]\npublic string Iv { get; set; }\n\n[JsonProperty(\"content\")]\npublic string Content { get; set; }\n\n}\n\npublic class EndUserSecureRequestExample\n{\npublic string CreateSecuredRequest(FileInfo paylocityPublicKey, string unsecuredJsonRequest)\n{\nstring publicKeyXml = File.ReadAllText(paylocityPublicKey.FullName, Encoding.UTF8);\n\nSecuredContent secureContent = this.CreateSecuredContent(publicKeyXml, unsecuredJsonRequest);\n\nstring secureRequest = JsonConvert.SerializeObject(new { secureContent });\n\nreturn secureRequest;\n}\n\nprivate SecuredContent CreateSecuredContent(string publicKeyXml, string request)\n{\nusing (AesCryptoServiceProvider aesCsp = new AesCryptoServiceProvider())\n{\naesCsp.Mode = CipherMode.CBC;\naesCsp.Padding = PaddingMode.PKCS7;\naesCsp.BlockSize = 128;\naesCsp.KeySize = 256;\n\nusing (ICryptoTransform crt = aesCsp.CreateEncryptor(aesCsp.Key, aesCsp.IV))\n{\nusing (MemoryStream outputStream = new MemoryStream())\n{\nusing (CryptoStream encryptStream = new CryptoStream(outputStream, crt, CryptoStreamMode.Write))\n{\nbyte[] encodedRequest = Encoding.UTF8.GetBytes(request);\nencryptStream.Write(encodedRequest, 0, encodedRequest.Length);\nencryptStream.FlushFinalBlock();\nbyte[] encryptedRequest = outputStream.ToArray();\n\nusing (RSACryptoServiceProvider crp = new RSACryptoServiceProvider())\n{\ncrp.FromXmlstring(publicKeyXml);\nbyte[] encryptedKey = crp.Encrypt(aesCsp.Key, false);\n\nreturn new SecuredContent()\n{\nKey = Convert.ToBase64string(encryptedKey),\nIv = Convert.ToBase64string(aesCsp.IV),\nContent = Convert.ToBase64string(encryptedRequest)\n};\n}\n}\n}\n}\n}\n}\n}\n\n## Support\n\nQuestions about using the Paylocity API? Please contact webservices@paylocity.com.\n\n# Deductions (v1)\n\nDeductions API provides endpoints to retrieve, add, update and delete deductions for a company's employees. For schema details, click [here](https://docs.paylocity.com/weblink/guides/Paylocity_Web_Services_API/v1/Paylocity_Web_Services_API.htm).\n\n# OnBoarding (v1)\n\nOnboarding API sends employee data into Paylocity Onboarding to help ensure an easy and accurate hiring process for subsequent completion into Web Pay. For schema details, click [here](https://docs.paylocity.com/weblink/guides/Paylocity_Web_Services_API/v1/Paylocity_Web_Services_API.htm).",
  "categories": [
    "finance"
  ],
  "logo": "logo.jpg",
  "openApiJsonUrl": "https://api.apis.guru/v2/specs/paylocity.com/2/openapi.json",
  "openApiYamlUrl": "https://api.apis.guru/v2/specs/paylocity.com/2/openapi.yaml",
  "openApiVersion": "3.0.0",
  "externalDocsUrl": null,
  "source": "apis.guru"
}