{
  "name": "AWS Performance Insights",
  "description": "Amazon RDS Performance Insights Amazon RDS Performance Insights enables you to monitor and explore different dimensions of database load based on data captured from a running DB instance. The guide provides detailed information about Performance Insights data types, parameters and errors.\n\nWhen Performance Insights is enabled, the Amazon RDS Performance Insights API provides visibility into the performance of your DB instance. Amazon CloudWatch provides the authoritative source for Amazon Web Services service-vended monitoring metrics. Performance Insights offers a domain-specific view of DB load.\n\nDB load is measured as average active sessions. Performance Insights provides the data to API consumers as a two-dimensional time-series dataset. The time dimension provides DB load data for each time point in the queried time range. Each time point decomposes overall load in relation to the requested dimensions, measured at that time point. Examples include SQL, Wait event, User, and Host.\n\n\n- To learn more about Performance Insights and Amazon Aurora DB instances, go to the * [ Amazon Aurora User Guide](https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/USER_PerfInsights.html) *.\n- To learn more about Performance Insights and Amazon RDS DB instances, go to the * [ Amazon RDS User Guide](https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_PerfInsights.html) *.\n- To learn more about Performance Insights and Amazon DocumentDB clusters, go to the * [ Amazon DocumentDB Developer Guide](https://docs.aws.amazon.com/documentdb/latest/developerguide/performance-insights.html) *.",
  "categories": [
    "cloud"
  ],
  "logo": "logo.png",
  "openApiJsonUrl": "https://api.apis.guru/v2/specs/amazonaws.com/pi/2018-02-27/openapi.json",
  "openApiYamlUrl": "https://api.apis.guru/v2/specs/amazonaws.com/pi/2018-02-27/openapi.yaml",
  "openApiVersion": "3.0.0",
  "externalDocsUrl": "https://docs.aws.amazon.com/pi/",
  "source": "apis.guru"
}