{
  "name": "Geneea Natural Language Processing",
  "description": "## Authentication\n\nFor all calls, supply your API key. [Sign up to *obtain the key*](https://www.geneea.com/pricing).\n\nOur API supports both *unencrypted (HTTP)* and *encrypted (HTTPS)* protocols.\nHowever, for security reasons, we strongly encourage using only the encrypted version.\n\nThe API key should be supplied as either a request parameter `user_key` or in `Authorization` header.\n\n```\n`Authorization: user_key <YOUR_API_KEY>`\n```\n\n## API operations\n\nAll API operations can perform analysis on supplied raw text or on text extracted from a given URL.\nOptionally, one can supply additional information which can make the result more precise. An example\nof such information would be the language of text or a particular text extractor for URL resources.\n\nThe supported types of analyses are:\n\n- **lemmatization** &longrightarrow;\nFinds out lemmata (basic forms) of all the words in the document.\n\n- **correction** &longrightarrow;\nPerforms correction (diacritization) on all the words in the document.\n\n- **topic detection** &longrightarrow;\nDetermines a topic of the document, e.g. finance or sports.\n\n- **sentiment analysis** &longrightarrow;\nDetermines a sentiment of the document, i.e. how positive or negative the document is.\n\n- **named entity recognition** &longrightarrow;\nFinds named entities (like person, location, date etc.) mentioned the the document.\n\n## Encoding\n\nThe supplied text is expected to be in UTF-8 encoding, this is especially important for non-english texts.\n\n## Returned values\n\nThe API calls always return objects in serialized JSON format in UTF-8 encoding.\n\nIf any error occurs, the HTTP response code will be in the range `4xx` (client-side error) or\n`5xx` (server-side error). In this situation, the body of the response will contain information\nabout the error in JSON format, with `exception` and `message` values.\n\n## URL limitations\n\nAll the requests are semantically `GET`. However, for longer texts, you may run into issues\nwith URL length limit. Therefore, it's possible to always issue a `POST` request with all\nthe parameters encoded as a JSON in the request body.\n\nExample:\n\n```\n`\nPOST /s1/sentiment\nContent-Type: application/json\n\n{\"text\":\"There is no harm in being sometimes wrong - especially if one is promptly found out.\"}\n`\n```\nThis is equivalent to `GET /s1/sentiment?text=There%20is%20no%20harm...`\n\n## Request limitations\n\nThe API has other limitations concerning the size of the HTTP requests. The maximum allowed size of any\nPOST request body is *512 KiB*. For request with a URL resource, the maximum allowed number of\nextracted characters from each such resource is *100,000*.\n\n## Terms of Service\n\nBy using the API, you agree to our\n[Terms of Service Agreement](https://www.geneea.com/terms.html).\n\n## More information\n\n[\nThe Interpretor Public Documentation\n](https://help.geneea.com/index.html)",
  "categories": [
    "text"
  ],
  "logo": "logo.png",
  "openApiJsonUrl": "https://api.apis.guru/v2/specs/geneea.com/1.0/swagger.json",
  "openApiYamlUrl": "https://api.apis.guru/v2/specs/geneea.com/1.0/swagger.yaml",
  "openApiVersion": "2.0",
  "externalDocsUrl": null,
  "source": "apis.guru"
}