{
  "name": "CORE API v2",
  "description": "You can use the CORE API to access the\nresources harvested and enriched by CORE. If you encounter any problems with the API, please [report them to us](/contact).\n\n## Overview\n\nThe API is organised by resource type. The resources are **articles**,\n**journals** and **repositories** and are represented using JSON data format. Furthermore,\neach resource has a list of methods. The API also provides two global methods for accessing all resources at once.\n\n## Response format\n\nResponse for each query contains two fields: **status** and **data**.\nIn case of an error status, the data field is empty. The data field contains a single object\nin case the request is for a specific identifier (e.g. CORE ID, CORE repository ID, etc.), or\ncontains a list of objects, for example for search queries. In case of batch requests, the response\nis an array of objects, each of which contains its own **status** and **data** fields.\nFor search queries the response contains an additional field **totalHits**, which is the\ntotal number of items which match the search criteria.\n\n## Search query syntax\n\nComplex search queries can be used in all of the API search methods.\nThe query can be a simple string or it can be built using terms and operators described in Elasticsearch\n[documentation](http://www.elastic.co/guide/en/elasticsearch/reference/1.4/query-dsl-query-string-query.html#query-string-syntax).\nThe usable field names are **title**, **description**, **fullText**,\n**authors**, **publisher**, **repositories.id**, **repositories.name**,\n**doi**, **oai**, **identifiers** (which is a list of article identifiers including OAI, URL, etc.), **language.name**\nand **year**. Some example queries:\n\n- title:psychology and language.name:English\n\n- repositories.id:86 AND year:2014\n\n- identifiers:\"oai:aura.abdn.ac.uk:2164/3837\" OR identifiers:\"oai:aura.abdn.ac.uk:2164/3843\"\n\n- doi:\"10.1186/1471-2458-6-309\"\n\n### Retrieving the latest Articles\n\nYou can retrieve the harvested items since specific dates using the following queries:\n\n- repositoryDocument.metadataUpdated:>2017-02-10\n\n- repositoryDocument.metadataUpdated:>2017-03-01 AND repositoryDocument.metadataUpdated:<2017-03-31\n\n## Sort order\n\nFor search queries, the results are ordered by relevance score. For batch\nrequests, the results are retrieved in the order of the requests.\n\n## Parameters\n\nThe API methods allow different parameters to be passed. Additionally, there is an API key parameter which is common to all API methods. For all API methods\nthe API key can be provided either as a query parameter or in the request header. If the API key\nis not provided, the API will return HTTP 401 error. You can register for an API key [here](/services#api).\n\n## API methods",
  "categories": [
    "open_data"
  ],
  "logo": "logo.png",
  "openApiJsonUrl": "https://api.apis.guru/v2/specs/core.ac.uk/2.0/swagger.json",
  "openApiYamlUrl": "https://api.apis.guru/v2/specs/core.ac.uk/2.0/swagger.yaml",
  "openApiVersion": "2.0",
  "externalDocsUrl": null,
  "source": "apis.guru"
}